# RbsFpSprinklerResponseParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsFpSprinklerResponseParam Property
ParameterTypeId Class See Also
---
"Response"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsFpSprinklerResponseParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsFpSprinklerResponseParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsFpSprinklerResponseParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace